[
  {
    "id": "Discover",
    "image": "/static/icons/discover.svg",
    "timeRange": "Jun 2019 - Present",
    "title": "Software Engineer",
    "paragraphs": [
      {
        "title": "THis is some stuff I did",
        "paragraph": "This is a paragraph for some stuff i did"
      },
      {
        "title": "THis is some stuff I did",
        "paragraph": "This is a paragraph for some stuff i did"
      }
    ],
    "imageContent": []
  },
  {
    "id": "Oqullo",
    "image": "/static/icons/oqullo.png",
    "timeRange": "Feb 2020 - May 2020",
    "title": "Software Engineer Contractor",
    "paragraphs": [
      {
        "title": "Flagship Application for Oqullo, a property analysis startup.",
        "paragraph": "Coordinated closely with the founders to create an MVP1 to showcase their property analysis abilities to customers. Oqullo, the application, was created from scratch with a React frontend, NodeJS backend, and MongoDB database."
      },
      {
        "title": "Application Overview",
        "paragraph": "The application visualizes path density of customers on a property, and the store's capture rate of customers on the path. Customer path direction from a selected source. Other stores a customer visited from a selected source. A primary demographic breakdown with a sunburst chart. All which are filterable by time range, gender, and age demographic."
      }
    ],
    "imageContent": [
      {
        "original": "/static/oqullo-app/a.png",
        "thumbnail": "/static/oqullo-app/a.png"
      },
      {
        "original": "/static/oqullo-app/b.png",
        "thumbnail": "/static/oqullo-app/b.png"
      },
      {
        "original": "/static/oqullo-app/c.png",
        "thumbnail": "/static/oqullo-app/c.png"
      },
      {
        "original": "/static/oqullo-app/d.png",
        "thumbnail": "/static/oqullo-app/d.png"
      },
      {
        "original": "/static/oqullo-app/e.png",
        "thumbnail": "/static/oqullo-app/e.png"
      },
      {
        "original": "/static/oqullo-app/f.png",
        "thumbnail": "/static/oqullo-app/f.png"
      }
    ]
  },
  {
    "id": "Labelling Tool",
    "image": "/static/icons/VOTT.svg",
    "timeRange": "Apr 2020 - May 2020",
    "title": "Software Engineer Contractor",
    "paragraphs": [
      {
        "title": "Enhancing Microsoft's Open Source Visual Object Tracking Tool",
        "paragraph": "I added functionality to an open source project to help a company, Oqullo, have a better user experience while labelling data. With such a large quantity of data to label, it was intractable to label objects for every frame in a video."
      },
      {
        "title": "Application Overview",
        "paragraph": "This is a React Proton application written in typescript, NodeJS backend, and MongoDB database. A labeller will tag an object in the frame and give it children tags, to further identify the object. On the next frame when creating a tag, if the user again tags with a child tag similar to the previous object it would recommend that tagging number. As the data set gets larger, it recommends objects based on how many tags in common the object has."
      }
    ],
    "imageContent": []
  },
  {
    "id": "Preservation",
    "image": "/static/icons/preservation.png",
    "timeRange": "Jan 2020 - Feb 2020",
    "title": "Web Developer",
    "paragraphs": [
      {
        "title": "Web based shopping experience for a new clothing line",
        "paragraph": "This was my first production application that received traffic from users. I learned a great deal about working with a customer to create a platform that fit their vision. It was also an interesting experience to see how users interacted with the platform, and what my short comings for UX/UI were. This was a React application hosted on GitHub Pages making GraphQL calls to Shopify API."
      }
    ],
    "imageContent": [
      {
        "original": "/static/preservation/a.png",
        "thumbnail": "/static/preservation/a.png"
      },
      {
        "original": "/static/preservation/b.png",
        "thumbnail": "/static/preservation/b.png"
      },
      {
        "original": "/static/preservation/c.png",
        "thumbnail": "/static/preservation/c.png"
      },
      {
        "original": "/static/preservation/d.png",
        "thumbnail": "/static/preservation/d.png"
      },
      {
        "original": "/static/preservation/e.png",
        "thumbnail": "/static/preservation/e.png"
      }
    ]
  },
  {
    "id": "Neighborhoods",
    "image": "/static/icons/neighborhoods.jpeg",
    "timeRange": "Jun 2017 - Aug 2017",
    "title": "Software Engineer Intern",
    "paragraphs": [
      {
        "title": "Online real estate startup, my first Software Engineering job",
        "paragraph": "I worked closely with their marketing team to create an internal tool to automate their online advertisement placements for Google Ads. This tool was my first enterprise application that I developed. They still use the tool to this day."
      },
      {
        "title": "Application Overview",
        "paragraph": "The tool was created in vanilla Java using the Google AdWords API. Given a CSV file generated from their reporting tool my application would select a region of houses to create advertisements for. The advertisements would target a certain geographical region for more impact and precision per advertisement, while reducing cost. The advirertisements increased their traffic, and created sales for the company."
      }
    ],
    "imageContent": []
  },
  {
    "id": "Firestarter",
    "image": "/static/icons/firestarter.png",
    "timeRange": "Jan 2019 - Apr 2019",
    "title": "Cohort Member",
    "paragraphs": [
      {
        "title": "Taking our business idea to Purdue's startup incubator",
        "paragraph": "During my Senior year an Environmental Engineer and I had an idea and wanted to turn it into a business. We participated in Purdue's firestarter program to asses our business concept."
      },
      {
        "title": "Creating a product from a concept",
        "paragraph": "We underwent market validation, customer discovery, and pitch presentations. Market validation allowed me to see that you don't just need an idea, but the proper confditions for an idea to make sense. Calling up potential customers, and talking with them to understand their pain points greatly improved how I saw problems in a business and what actions could be taken to fix them. Finally, pitch presentations refined my business communication skills. Teaching me to reach a wider audience and with greater effect."
      }
    ],
    "imageContent": []
  },
  {
    "id": "DoIT",
    "image": "/static/icons/DOIT.jpg",
    "timeRange": "Jul 2014 - Sep 2014",
    "title": "Technology Intern",
    "paragraphs": [
      {
        "title": "Department of Innovation and Technology for the City of Chicago",
        "paragraph": "My very first job working in the technology sector. I had a passion for computers since a young age. I first started programming as a Freshman in Highschool. During my Junior I got the oppurtunity to work for DoIT. While I didn't engineer any software during my time there, I was very hands on with the technology. My primary focus was reimaging computers and providing technical support for all the city's employees. Having this job made me understand this is what I wanted to be a part of for the rest of my life."
      }
    ],
    "imageContent": []
  }
]
